universal-quantification-in-ocaml.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-03-04 Sat 00:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Universal Quantification in OCaml</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="Difference between using signatures and annotations in OCaml"
>
<meta name="keywords" content="ocaml, types">

<link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./universal-quantification-in-ocaml.html"> Universal Quantification in OCaml</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( February 2, 2016)</span></span></h3>
</p>

<p>
The difference between OCaml&rsquo;s type signatures and type annotations is quite
subtle. First of all, signatures are what you put in the mli files, whereas
annotations are inline with your code. When you write a function like:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">foo</span> <span class="org-tuareg-font-lock-operator">:</span> <span class="org-type">'a </span><span class="org-tuareg-font-lock-operator">-&gt;</span><span class="org-type"> 'a </span><span class="org-tuareg-font-lock-operator">=</span> <span class="org-keyword">fun</span> <span class="org-variable-name">x</span> <span class="org-tuareg-font-lock-operator">-&gt;</span> 0
</pre>
</div>
<p>
the type of <code>foo</code> resolves to <code>int -&gt; int</code>, because <code>'a</code> is
serving as a unification variable and not a type parameter. In order to force
the compiler to not constrain the function to the concrete type <code>int</code>, you need
to annotate:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">foo</span> <span class="org-tuareg-font-lock-operator">:</span> <span class="org-type">'a. 'a </span><span class="org-tuareg-font-lock-operator">-&gt;</span><span class="org-type"> 'a </span><span class="org-tuareg-font-lock-operator">=</span> <span class="org-keyword">fun</span> <span class="org-variable-name">x</span> <span class="org-tuareg-font-lock-operator">-&gt;</span> 0
</pre>
</div>
<p>
Essentially, this means &ldquo;for all types &lsquo;a&rdquo;, and now we are dealing with a type
parameter instead, forcing the compiler to keep the function polymorphic. The
mli files work with type parameters by default, so if you are writing type
signatures there you might not run into this problem. However, sometimes your
function will not typecheck (because it&rsquo;s unclear) until you annotate it with
the type ascription, and you&rsquo;ll need to do that before the mli can be checked by
the compiler.
</p>

<p>
There&rsquo;s some more info about this on <a href="http://stackoverflow.com/questions/23323032/in-ocaml-what-type-definition-is-this-a-unit-a">SO</a> and <a href="https://blogs.janestreet.com/ensuring-that-a-function-is-polymorphic-in-ocaml-3-12/">Jane Street&rsquo;s blog</a>.
</p>

<p>
</div>
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
